In [14]:
import pandas as pd
import pandas as pd
import numpy as np
import datetime as dt


df1= pd.read_csv(r'C:\Users\arvinmvn\AppData\Local\Temp\sss.csv',)

In [15]:
df1.head()

,Week,Entry Date,User ID,Training( in minutes),System Issues(in minutes),Break (in minutes),Meeting (inminutes),Total deficit(in hour),Production (in hrs)
0,14,04/08/2021,keerdoss,10.0,10.0,60.0,12.0,1.53,7.47
1,#VALUE!,NaN,NaN,NaN,NaN,NaN,NaN,0.00,9.00
2,#VALUE!,NaN,NaN,NaN,NaN,NaN,NaN,0.00,9.00
3,#VALUE!,NaN,NaN,NaN,NaN,NaN,NaN,0.00,9.00
4,#VALUE!,NaN,NaN,NaN,NaN,NaN,NaN,0.00,9.00

In [17]:
##drop the null values

df1.dropna(subset = ["Entry Date"], inplace=True)
df1.head()

,Week,Entry Date,User ID,Training( in minutes),System Issues(in minutes),Break (in minutes),Meeting (inminutes),Total deficit(in hour),Production (in hrs)
0,14,04/08/2021,keerdoss,10.0,10.0,60.0,12.0,1.53,7.47

,User ID,Entry Date,Start Time,End Date,End Time,Status,Level 2 Status,Level 3 Status,Comments (optional),Actions,Autolog Hours,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
1,keerdoss,2021-03-30,14:28:00,Mar 30 2021,15:01:00,Production,Production,None Selected,NaN,NaN,,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,keerdoss,2021-03-31,06:57:00,Mar 31 2021,15:00:00,Production,Production,None Selected,NaN,NaN,,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,keerdoss,2021-03-31,06:56:00,Apr 01 2021,09:43:00,Production,Production,None Selected,NaN,NaN,,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,keerdoss,2021-04-01,09:43:00,Apr 01 2021,09:49:00,Production,Production,None Selected,NaN,NaN,,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,keerdoss,2021-04-01,09:49:00,Apr 01 2021,15:02:00,Production,Production,None Selected,NaN,NaN,,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
table = pd.pivot_table(df1, values=['Production (in hrs)'], index=['User ID'], columns= ['Date'] ,margins=False,
               margins_name='total', aggfunc=sum , fill_value=0)
table.round(2)

         Production (in hrs)
Date              04/08/2021
User ID
keerdoss                7.47

In [28]:
for i in range(0,len(df1)):
            sh=  str(df1['End Time'].values[i])
            sv=  str(df1['Start Time'].values[i])
            h,m,s = sh.split(':' or '.')
            p,r,b = sv.split(':' or '.')
            df1['Autolog Hours'].values[i]= float(dt.timedelta(hours=int(h),minutes=int(m),seconds=float(s)).total_seconds()/3600)- float(dt.timedelta(hours=int(p),minutes=int(r),seconds=float(b)).total_seconds()/3600)
            i=i+1

In [29]:
df1.head()

,User ID,Entry Date,Start Time,End Date,End Time,Status,Level 2 Status,Level 3 Status,Comments (optional),Actions,Autolog Hours,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
1,keerdoss,2021-03-30,14:28:00,Mar 30 2021,15:01:00,Production,Production,None Selected,NaN,NaN,0.55,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,keerdoss,2021-03-31,06:57:00,Mar 31 2021,15:00:00,Production,Production,None Selected,NaN,NaN,8.05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,keerdoss,2021-03-31,06:56:00,Apr 01 2021,09:43:00,Production,Production,None Selected,NaN,NaN,2.78333,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,keerdoss,2021-04-01,09:43:00,Apr 01 2021,09:49:00,Production,Production,None Selected,NaN,NaN,0.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,keerdoss,2021-04-01,09:49:00,Apr 01 2021,15:02:00,Production,Production,None Selected,NaN,NaN,5.21667,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
table = pd.pivot_table(df1, values=['Autolog Hours'], index=['User ID'], columns= ['Entry Date'] ,margins=False,
               margins_name='total', aggfunc=sum , fill_value=0)
table.round(2)

           Autolog Hours
Entry Date    2021-03-30 2021-03-31 2021-04-01 2021-04-03
User ID
keerdoss            0.55      10.83       5.32       8.08